Tasks/СоздатьМодельГабаритногоЧертежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>СоздатьМодельГабаритногоЧертежа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/СоздатьМодельГабаритногоЧертежа/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеФормы()

	Если НЕ Объект.Выполнена 
		И Объект.КрайняяДатаИсполнения > Дата(1, 1, 1) 
		И Объект.КрайняяДатаИсполнения < НачалоДня(ТекущаяДата()) Тогда
	
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(255, 10, 10);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
		
	Иначе
		
		Элементы.КрайняяДатаИсполнения.ЦветТекста 			= Новый Цвет(0, 0, 0);
		Элементы.КрайняяДатаИсполнения.ЦветТекстаЗаголовка 	= Элементы.КрайняяДатаИсполнения.ЦветТекста; 
	
	КонецЕсли; 
	                                                       
	Если Объект.Выполнена Тогда
		Элементы.ГруппаКнопки.Видимость 	= Ложь;
		Элементы.ФормаЗаписать.Доступность 	= Ложь;
		ТолькоПросмотр						= Истина;
	Иначе
		
		Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.КнопкаНачатьВыполнение.Видимость = Ложь;
			
		Иначе
			
			Элементы.КнопкаЗавершитьВыполнение.Видимость = Ложь;
			Элементы.КнопкаСброс.Видимость 			= Ложь; 
			Элементы.КнопкаНачатьВыполнение.Доступность	= ЗначениеЗаполнено(Объект.Исполнитель); 
			
		КонецЕсли;
		
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры // ОформлениеФормы()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.Исполнитель.ТолькоПросмотр 		= ЗначениеЗаполнено(Объект.Исполнитель);
	КонецЕсли;
	
	МаксимальноеКоличествоЗадачСоздание = омЗадачиПКДПовтор.ПолучитьКоличествоЗадачСозданиеЗамеров();  
	
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныйЧертежПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
	
		ДанныеГЧ = ПолучитьПроектГЧ(Объект.ГабаритныйЧертеж);
		
		Объект.Проект 		= ДанныеГЧ.Проект;	
		Объект.Наименование = ДанныеГЧ.Наименование;	
	
	Иначе
	
		Объект.Проект 		= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	   	Объект.Наименование	= "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектГЧ(ГабаритныйЧертеж)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Проект КАК Проект,
		|	ГабаритныеЧертежи.Наименование + "".Создание"" КАК Наименование
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Ссылка = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеГЧ = Новый Структура("Проект, Наименование", Справочники.Проекты.ПустаяСсылка(), "");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеГЧ, Выборка);
	КонецЦикла;
	
    Возврат ДанныеГЧ;
	
КонецФункции // ПолучитьПроектГЧ()

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ЗапуститьДействие("НачатьВыполнение");
		
	Иначе
		
		СтруктурайПользователь = омСотрудники.ПолучитьТекущегоПользователя(,Истина);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполненияИсполнителя", ЭтаФорма
								, Новый Структура("ТекущийПользователь", СтруктурайПользователь.ТекущийПользователь));
								
		ПоказатьВопрос(Оповещение, "Назначить исполнителем " + СтруктурайПользователь.Наименование, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполненияИсполнителя(Результат, Параметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Исполнитель = Параметр.ТекущийПользователь;
		Записать();
		ЗапуститьДействие("НачатьВыполнение");
	Иначе
		ПоказатьПредупреждение(,"Не заполнен Исполнитель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗапуститьДействие(Действие)
	
	СтруктураОтвета = ДействияНаСервере(Действие, Объект.Ссылка, Объект.ТипЗадачи, Объект.Исполнитель);
	
	
	Оповестить("ИзменениеЗамеров");
	
	Закрыть();
	
	
КонецФункции // СтруктураОтвета()

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("ЗавершитьВыполнение");
	
КонецПроцедуры

&НаКлиенте
Процедура Сброс(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ЗапуститьДействие("Сброс");
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель)

	Возврат Задачи.СоздатьМодельГабаритногоЧертежа.ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель);	

КонецФункции //  ДействияНаСервере(Действие, Задача, ТипЗадачи, Исполнитель = Неопределено)()

&НаСервереБезКонтекста
Функция ИсполнительПриИзмененииНаСервере(Исполнитель)
	Возврат Задачи.ПроверитьГабаритныеЧертежи.КоличествоЗапущеныхЗадач(Исполнитель);  
КонецФункции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		
		Элементы.ГруппаКнопки.Видимость = Истина;
		
		КоличествоЗапущеныхЗадач = ИсполнительПриИзмененииНаСервере(Объект.Исполнитель);
		
		Если КоличествоЗапущеныхЗадач < МаксимальноеКоличествоЗадачСоздание Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Истина;
			
		ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ТипыЗадачКонструирования.ЗамерИзменение") Тогда
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Ложь;
			
		Иначе
			
			Элементы.ДекорацияЗапущеныеЗадания.Видимость 	= Истина;
			Элементы.ДекорацияЗапущеныеЗадания.Заголовок 	= "Уже в работе " + КоличествоЗапущеныхЗадач + " из " + МаксимальноеКоличествоЗадачСоздание + " возможнвх.";
			Элементы.КнопкаНачатьВыполнение.Доступность 	= Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаКнопки.Видимость = Ложь;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Я_исполнитель(Команда)
	
	ИсполнительЯ = омСотрудники.ПолучитьТекущегоПользователя();
	
	Если НЕ Объект.Исполнитель = ИсполнительЯ Тогда
		
		Объект.Исполнитель = ИсполнительЯ;
		ИсполнительПриИзменении(Неопределено);
		
	КонецЕсли;
КонецПроцедуры
